In [2]:
# (EN) Create, read and save files
# (ES) Crear, leer y guardar archivos

In [3]:
import pandas as pd
import sqlite3

## 1 - Crear DataFrame y Serie

#### 1.1 - Crear un DataFrame

In [4]:
new_df = pd.DataFrame({'key': 'valor'}, index = ["Nombre del índice"])
new_df

                     key
Nombre del índice  valor

In [5]:
fruits = pd.DataFrame({'fruits': ['Apple', 'Banana', 'Orange'],
                       'color': ['Red', 'Yellow', 'Orange']}, index= ['item_001', 'item_002', 'item_003'])
fruits

          fruits   color
item_001   Apple     Red
item_002  Banana  Yellow
item_003  Orange  Orange

#### 1.2 - Crear una Serie

In [6]:
new_series = pd.Series([1, 2, 3], index= ['Indice A', 'Indice B', 'Indice C'], name= 'Nombre_de_serie')
new_series

Indice A    1
Indice B    2
Indice C    3
Name: Nombre_de_serie, dtype: int64

In [7]:
stock = pd.Series([50, 100, 160], index= ['item_001', 'item_002', 'item_003'], name= 'stock')
stock

item_001     50
item_002    100
item_003    160
Name: stock, dtype: int64

#### 1.3 - Agregar Serie a un DataFrame

In [ ]:
# df['nombre_de_columna'] = serie

In [9]:
fruits['stock'] = stock
fruits

          fruits   color  stock
item_001   Apple     Red     50
item_002  Banana  Yellow    100
item_003  Orange  Orange    160

#### 1.4 - Convertir una columna de un DataFrame a una Serie

In [10]:
# serie = df['columna']

In [11]:
products = fruits['fruits']
products

item_001     Apple
item_002    Banana
item_003    Orange
Name: fruits, dtype: object

## 2 - Leer archivos

#### 2.1 - Leer un archivo csv

In [12]:
peliculas = pd.read_csv("../data/netflix_titles.csv", index_col= 0)
peliculas

,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
show_id,,,,,,,,,,,
s1,Movie,Dick Johnson Is Dead,Kirsten Johnson,NaN,United States,"September 25, 2021",2020,PG-13,90 min,Documentaries,"As her father nears the end of his life, filmm..."
s2,TV Show,Blood & Water,NaN,"Ama Qamata, Khosi Ngema, Gail Mabalane, Thaban...",South Africa,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, TV Dramas, TV Mysteries","After crossing paths at a party, a Cape Town t..."
s3,TV Show,Ganglands,Julien Leclercq,"Sami Bouajila, Tracy Gotoas, Samuel Jouy, Nabi...",NaN,"September 24, 2021",2021,TV-MA,1 Season,"Crime TV Shows, International TV Shows, TV Act...",To protect his family from a powerful drug lor...
s4,TV Show,Jailbirds New Orleans,NaN,NaN,NaN,"September 24, 2021",2021,TV-MA,1 Season,"Docuseries, Reality TV","Feuds, flirtations and toilet talk go down amo..."
s5,TV Show,Kota Factory,NaN,"Mayur More, Jitendra Kumar, Ranjan Raj, Alam K...",India,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, Romantic TV Shows, TV ...",In a city of coaching centers known to train I...
...,...,...,...,...,...,...,...,...,...,...,...
s8803,Movie,Zodiac,David Fincher,"Mark Ruffalo, Jake Gyllenhaal, Robert Downey J...",United States,"November 20, 2019",2007,R,158 min,"Cult Movies, Dramas, Thrillers","A political cartoonist, a crime reporter and a..."
s8804,TV Show,Zombie Dumb,NaN,NaN,NaN,"July 1, 2019",2018,TV-Y7,2 Seasons,"Kids' TV, Korean TV Shows, TV Comedies","While living alone in a spooky town, a young g..."
s8805,Movie,Zombieland,Ruben Fleischer,"Jesse Eisenberg, Woody Harrelson, Emma Stone, ...",United States,"November 1, 2019",2009,R,88 min,"Comedies, Horror Movies",Looking to survive in a world taken over by zo...
s8806,Movie,Zoom,Peter Hewitt,"Tim Allen, Courteney Cox, Chevy Chase, Kate Ma...",United States,"January 11, 2020",2006,PG,88 min,"Children & Family Movies, Comedies","Dragged from civilian life, a former superhero..."
s8807,Movie,Zubaan,Mozez Singh,"Vicky Kaushal, Sarah-Jane Dias, Raaghav Chanan...",India,"March 2, 2019",2015,TV-14,111 min,"Dramas, International Movies, Music & Musicals",A scrappy but poor boy worms his way into a ty...

#### 2.2 - Leer un archivo json

In [13]:
frutas_json = pd.read_json("../data/datos.json")
frutas_json

   id    fruta     color  precio  stock
0   1  Manzana      Rojo     300     50
1   2  Platano  Amarillo     400    100
2   3  Naranja   Naranjo     200    160

#### 2.3 - Leer un archivo SQL

In [14]:
conexion = sqlite3.connect("../data/frutas.db")
frutas_sql = pd.read_sql("SELECT * FROM frutas", conexion)
frutas_sql

   id    fruta     color  stock
0   1  Manzana      Rojo   1000
1   2  Platano  Amarillo   2000
2   3  Naranja   Naranjo   3000

## 3 - Guardar Archivos

#### 3.1 - Guardar archivo csv

In [15]:
fruits.to_csv("../outputs/fruits.csv")

#### 3.2 - Guardar archivo json

In [16]:
fruits.to_json("../outputs/fruits.json")

#### 3.3 - Insertar tabla dentro de una base de datos SQL

In [ ]:
fruits.to_sql('fruits', conexion)

In [ ]:
pd.read_sql("SELECT * FROM fruits", conexion)

      index  fruits   color  stock
0  item_001   Apple     Red     50
1  item_002  Banana  Yellow    100
2  item_003  Orange  Orange    160

In [ ]:
pd.read_sql("SELECT * FROM frutas", conexion)

   id    fruta     color  stock
0   1  Manzana      Rojo   1000
1   2  Platano  Amarillo   2000
2   3  Naranja   Naranjo   3000

In [ ]:
# Verificar todas las tablas dentro de una base de datos
pd.read_sql("SELECT name FROM sqlite_master WHERE type='table';", conexion)

     name
0  frutas
1  fruits

#### 3.4 - Guardar un archivo SQL

In [18]:
# Crear una base de datos nueva en outputs
conexion = sqlite3.connect("../outputs/fruits.db")

# Guardar el DataFrame dentro de esa base
fruits.to_sql("fruits", conexion, if_exists="replace", index=False)

conexion.close()